haliwt/UnipolarMotor_pic18f24k40PRO/mcc_generated_files/pin_manager.h
/**
  @Generated Pin Manager Header File

  @Company:
    Microchip Technology Inc.

  @File Name:
    pin_manager.h

  @Summary:
    This is the Pin Manager file generated using PIC10 / PIC12 / PIC16 / PIC18 MCUs

  @Description
    This header file provides APIs for driver for .
    Generation Information :
        Product Revision  :  PIC10 / PIC12 / PIC16 / PIC18 MCUs - 1.81.7
        Device            :  PIC18F24K40
        Driver Version    :  2.11
    The generated drivers are tested against the following:
        Compiler          :  XC8 2.31 and above
        MPLAB 	          :  MPLAB X 5.45	
*/

/*
    (c) 2018 Microchip Technology Inc. and its subsidiaries. 
    
    Subject to your compliance with these terms, you may use Microchip software and any 
    derivatives exclusively with Microchip products. It is your responsibility to comply with third party 
    license terms applicable to your use of third party software (including open source software) that 
    may accompany Microchip software.
    
    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY 
    IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS 
    FOR A PARTICULAR PURPOSE.
    
    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP 
    HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO 
    THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL 
    CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT 
    OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS 
    SOFTWARE.
*/

#ifndef PIN_MANAGER_H
#define PIN_MANAGER_H

/**
  Section: Included Files
*/

#include <xc.h>

#define INPUT   1
#define OUTPUT  0

#define HIGH    1
#define LOW     0

#define ANALOG      1
#define DIGITAL     0

#define PULL_UP_ENABLED      1
#define PULL_UP_DISABLED     0

// get/set LED1_RA0 aliases
#define MOTOR_EN_RA0_SetHigh()          do { LATAbits.LATA0 = 1; } while(0)
#define MOTOR_EN_RA0_SetLow()           do { LATAbits.LATA0 = 0; } while(0)
#define MOTOR_EN_RA0_TRIS                 TRISAbits.TRISA0
#define LMOTOR_EN_RA0_LAT                  LATAbits.LATA0
#define MOTOR_EN_RA0_PORT                 PORTAbits.RA0
#define LMOTOR_EN_RA0_WPU                  WPUAbits.WPUA0
#define MOTOR_EN_RA0_OD                   ODCONAbits.ODCA0
#define MOTOR_EN_RA0_ANS                  ANSELAbits.ANSELA0
#define MOTOR_EN_RA0_SetHigh()            do { LATAbits.LATA0 = 1; } while(0)
#define MOTOR_EN_RA0_SetLow()             do { LATAbits.LATA0 = 0; } while(0)
#define MOTOR_EN_RA0_Toggle()             do { LATAbits.LATA0 = ~LATAbits.LATA0; } while(0)
#define MOTOR_EN_RA0_GetValue()           PORTAbits.RA0
#define MOTOR_EN_RA0_SetDigitalInput()    do { TRISAbits.TRISA0 = 1; } while(0)
#define LMOTOR_EN_RA0_SetDigitalOutput()   do { TRISAbits.TRISA0 = 0; } while(0)
#define MOTOR_EN_RA0_SetPullup()          do { WPUAbits.WPUA0 = 1; } while(0)
#define LMOTOR_EN_RA0_ResetPullup()        do { WPUAbits.WPUA0 = 0; } while(0)
#define MOTOR_EN_RA0_SetPushPull()        do { ODCONAbits.ODCA0 = 0; } while(0)
#define MOTOR_EN_RA0_SetOpenDrain()       do { ODCONAbits.ODCA0 = 1; } while(0)
#define MOTOR_EN_RA0_SetAnalogMode()      do { ANSELAbits.ANSELA0 = 1; } while(0)
#define LMOTOR_EN_RA0_SetDigitalMode()     do { ANSELAbits.ANSELA0 = 0; } while(0)

// get/set LED2_RA1 aliases
#define MOTOR_DIR_RA1_SetHigh()       do { LATAbits.LATA1 = 1; } while(0)
#define MOTOR_DIR_RA1_SetLow()        do { LATAbits.LATA1 = 0; } while(0)
#define MOTOR_DIR_RA1_TRIS                 TRISAbits.TRISA1
#define LMOTOR_DIR_RA1_LAT                  LATAbits.LATA1
#define MOTOR_DIR_RA1_PORT                 PORTAbits.RA1
#define MOTOR_DIR_RA1_WPU                  WPUAbits.WPUA1
#define MOTOR_DIR_RA1_OD                   ODCONAbits.ODCA1
#define LMOTOR_DIR_RA1_ANS                  ANSELAbits.ANSELA1
#define MOTOR_DIR_RA1_SetHigh()            do { LATAbits.LATA1 = 1; } while(0)
#define MOTOR_DIR_RA1_SetLow()             do { LATAbits.LATA1 = 0; } while(0)
#define MOTOR_DIR_RA1_Toggle()             do { LATAbits.LATA1 = ~LATAbits.LATA1; } while(0)
#define MOTOR_DIR_RA1_GetValue()           PORTAbits.RA1
#define MOTOR_DIR_RA1_SetDigitalInput()    do { TRISAbits.TRISA1 = 1; } while(0)
#define MOTOR_DIR_RA1_SetDigitalOutput()   do { TRISAbits.TRISA1 = 0; } while(0)
#define LMOTOR_DIR_RA1_SetPullup()          do { WPUAbits.WPUA1 = 1; } while(0)
#define MOTOR_DIR_RA1_ResetPullup()        do { WPUAbits.WPUA1 = 0; } while(0)
#define MOTOR_DIR_RA1_SetPushPull()        do { ODCONAbits.ODCA1 = 0; } while(0)
#define MOTOR_DIR_RA1_SetOpenDrain()       do { ODCONAbits.ODCA1 = 1; } while(0)
#define MOTOR_DIR_RA1_SetAnalogMode()      do { ANSELAbits.ANSELA1 = 1; } while(0)
#define MOTOR_DIR_RA1_SetDigitalMode()     do { ANSELAbits.ANSELA1 = 0; } while(0)

// get/set LED3_RA2 aliases
#define LED1_RA2_TRIS                 TRISAbits.TRISA2
#define LED1_RA2_LAT                  LATAbits.LATA2
#define LED1_RA2_PORT                 PORTAbits.RA2
#define LED1_RA2_WPU                  WPUAbits.WPUA2
#define LED1_RA2_OD                   ODCONAbits.ODCA2
#define LED1_RA2_ANS                  ANSELAbits.ANSELA2
#define LED1_RA2_SetHigh()            do { LATAbits.LATA2 = 1; } while(0)
#define LED1_RA2_SetLow()             do { LATAbits.LATA2 = 0; } while(0)
#define LED1_RA2_Toggle()             do { LATAbits.LATA2 = ~LATAbits.LATA2; } while(0)
#define LED1_RA2_GetValue()           PORTAbits.RA2
#define LED1_RA2_SetDigitalInput()    do { TRISAbits.TRISA2 = 1; } while(0)
#define LED1_RA2_SetDigitalOutput()   do { TRISAbits.TRISA2 = 0; } while(0)
#define LED1_RA2_SetPullup()          do { WPUAbits.WPUA2 = 1; } while(0)
#define LED3_RA2_ResetPullup()        do { WPUAbits.WPUA2 = 0; } while(0)
#define LED3_RA2_SetPushPull()        do { ODCONAbits.ODCA2 = 0; } while(0)
#define LED3_RA2_SetOpenDrain()       do { ODCONAbits.ODCA2 = 1; } while(0)
#define LED3_RA2_SetAnalogMode()      do { ANSELAbits.ANSELA2 = 1; } while(0)
#define LED3_RA2_SetDigitalMode()     do { ANSELAbits.ANSELA2 = 0; } while(0)

// get/set LED4_RA3 aliases
#define LED2_RA3_TRIS                 TRISAbits.TRISA3
#define LED4_RA3_LAT                  LATAbits.LATA3
#define LED4_RA3_PORT                 PORTAbits.RA3
#define LED4_RA3_WPU                  WPUAbits.WPUA3
#define LED4_RA3_OD                   ODCONAbits.ODCA3
#define LED2_RA3_ANS                  ANSELAbits.ANSELA3
#define LED2_RA3_SetHigh()            do { LATAbits.LATA3 = 1; } while(0)
#define LED2_RA3_SetLow()             do { LATAbits.LATA3 = 0; } while(0)
#define LED2_RA3_Toggle()             do { LATAbits.LATA3 = ~LATAbits.LATA3; } while(0)
#define LED2_RA3_GetValue()           PORTAbits.RA3
#define LED2_RA3_SetDigitalInput()    do { TRISAbits.TRISA3 = 1; } while(0)
#define LED2_RA3_SetDigitalOutput()   do { TRISAbits.TRISA3 = 0; } while(0)
#define LED2_RA3_SetPullup()          do { WPUAbits.WPUA3 = 1; } while(0)
#define LED2_RA3_ResetPullup()        do { WPUAbits.WPUA3 = 0; } while(0)
#define LED4_RA3_SetPushPull()        do { ODCONAbits.ODCA3 = 0; } while(0)
#define LED4_RA3_SetOpenDrain()       do { ODCONAbits.ODCA3 = 1; } while(0)
#define LED4_RA3_SetAnalogMode()      do { ANSELAbits.ANSELA3 = 1; } while(0)
#define LED4_RA3_SetDigitalMode()     do { ANSELAbits.ANSELA3 = 0; } while(0)

// get/set LED5_RA4 aliases
#define LED5_RA4_TRIS                 TRISAbits.TRISA4
#define LED5_RA4_LAT                  LATAbits.LATA4
#define LED5_RA4_PORT                 PORTAbits.RA4
#define LED5_RA4_WPU                  WPUAbits.WPUA4
#define LED5_RA4_OD                   ODCONAbits.ODCA4
#define LED5_RA4_ANS                  ANSELAbits.ANSELA4
#define LED5_RA4_SetHigh()            do { LATAbits.LATA4 = 1; } while(0)
#define LED5_RA4_SetLow()             do { LATAbits.LATA4 = 0; } while(0)
#define LED5_RA4_Toggle()             do { LATAbits.LATA4 = ~LATAbits.LATA4; } while(0)
#define LED5_RA4_GetValue()           PORTAbits.RA4
#define LED5_RA4_SetDigitalInput()    do { TRISAbits.TRISA4 = 1; } while(0)
#define LED5_RA4_SetDigitalOutput()   do { TRISAbits.TRISA4 = 0; } while(0)
#define LED5_RA4_SetPullup()          do { WPUAbits.WPUA4 = 1; } while(0)
#define LED5_RA4_ResetPullup()        do { WPUAbits.WPUA4 = 0; } while(0)
#define LED5_RA4_SetPushPull()        do { ODCONAbits.ODCA4 = 0; } while(0)
#define LED5_RA4_SetOpenDrain()       do { ODCONAbits.ODCA4 = 1; } while(0)
#define LED5_RA4_SetAnalogMode()      do { ANSELAbits.ANSELA4 = 1; } while(0)
#define LED5_RA4_SetDigitalMode()     do { ANSELAbits.ANSELA4 = 0; } while(0)

