haliwt/UnipolarMotor_pic18f24k40PRO/mcc_generated_files/pin_manager.h
// get/set LED6_RA5 aliases
#define LED6_RA5_TRIS                 TRISAbits.TRISA5
#define LED6_RA5_LAT                  LATAbits.LATA5
#define LED6_RA5_PORT                 PORTAbits.RA5
#define LED6_RA5_WPU                  WPUAbits.WPUA5
#define LED6_RA5_OD                   ODCONAbits.ODCA5
#define LED6_RA5_ANS                  ANSELAbits.ANSELA5
#define LED6_RA5_SetHigh()            do { LATAbits.LATA5 = 1; } while(0)
#define LED6_RA5_SetLow()             do { LATAbits.LATA5 = 0; } while(0)
#define LED6_RA5_Toggle()             do { LATAbits.LATA5 = ~LATAbits.LATA5; } while(0)
#define LED6_RA5_GetValue()           PORTAbits.RA5
#define LED6_RA5_SetDigitalInput()    do { TRISAbits.TRISA5 = 1; } while(0)
#define LED6_RA5_SetDigitalOutput()   do { TRISAbits.TRISA5 = 0; } while(0)
#define LED6_RA5_SetPullup()          do { WPUAbits.WPUA5 = 1; } while(0)
#define LED6_RA5_ResetPullup()        do { WPUAbits.WPUA5 = 0; } while(0)
#define LED6_RA5_SetPushPull()        do { ODCONAbits.ODCA5 = 0; } while(0)
#define LED6_RA5_SetOpenDrain()       do { ODCONAbits.ODCA5 = 1; } while(0)
#define LED6_RA5_SetAnalogMode()      do { ANSELAbits.ANSELA5 = 1; } while(0)
#define LED6_RA5_SetDigitalMode()     do { ANSELAbits.ANSELA5 = 0; } while(0)

// get/set WHITE_32_RA6 aliases
#define WHITE_32_RA6_TRIS                 TRISAbits.TRISA6
#define WHITE_32_RA6_LAT                  LATAbits.LATA6
#define WHITE_32_RA6_PORT                 PORTAbits.RA6
#define WHITE_32_RA6_WPU                  WPUAbits.WPUA6
#define WHITE_32_RA6_OD                   ODCONAbits.ODCA6
#define WHITE_32_RA6_ANS                  ANSELAbits.ANSELA6
#define WHITE_32_RA6_SetHigh()            do { LATAbits.LATA6 = 1; } while(0)
#define WHITE_32_RA6_SetLow()             do { LATAbits.LATA6 = 0; } while(0)
#define WHITE_32_RA6_Toggle()             do { LATAbits.LATA6 = ~LATAbits.LATA6; } while(0)
#define WHITE_32_RA6_GetValue()           PORTAbits.RA6
#define WHITE_32_RA6_SetDigitalInput()    do { TRISAbits.TRISA6 = 1; } while(0)
#define WHITE_32_RA6_SetDigitalOutput()   do { TRISAbits.TRISA6 = 0; } while(0)
#define WHITE_32_RA6_SetPullup()          do { WPUAbits.WPUA6 = 1; } while(0)
#define WHITE_32_RA6_ResetPullup()        do { WPUAbits.WPUA6 = 0; } while(0)
#define WHITE_32_RA6_SetPushPull()        do { ODCONAbits.ODCA6 = 0; } while(0)
#define WHITE_32_RA6_SetOpenDrain()       do { ODCONAbits.ODCA6 = 1; } while(0)
#define WHITE_32_RA6_SetAnalogMode()      do { ANSELAbits.ANSELA6 = 1; } while(0)
#define WHITE_32_RA6_SetDigitalMode()     do { ANSELAbits.ANSELA6 = 0; } while(0)

// get/set WHITE_8_RA7 aliases
#define WHITE_8_RA7_TRIS                 TRISAbits.TRISA7
#define WHITE_8_RA7_LAT                  LATAbits.LATA7
#define WHITE_8_RA7_PORT                 PORTAbits.RA7
#define WHITE_8_RA7_WPU                  WPUAbits.WPUA7
#define WHITE_8_RA7_OD                   ODCONAbits.ODCA7
#define WHITE_8_RA7_ANS                  ANSELAbits.ANSELA7
#define BLE_MODE_RA7_SetHigh()            do { LATAbits.LATA7 = 1; } while(0)
#define BLE_MODE_RA7_SetLow()             do { LATAbits.LATA7 = 0; } while(0)
#define WHITE_8_RA7_Toggle()             do { LATAbits.LATA7 = ~LATAbits.LATA7; } while(0)
#define WHITE_8_RA7_GetValue()           PORTAbits.RA7
#define WHITE_8_RA7_SetDigitalInput()    do { TRISAbits.TRISA7 = 1; } while(0)
#define WHITE_8_RA7_SetDigitalOutput()   do { TRISAbits.TRISA7 = 0; } while(0)
#define WHITE_8_RA7_SetPullup()          do { WPUAbits.WPUA7 = 1; } while(0)
#define WHITE_8_RA7_ResetPullup()        do { WPUAbits.WPUA7 = 0; } while(0)
#define WHITE_8_RA7_SetPushPull()        do { ODCONAbits.ODCA7 = 0; } while(0)
#define WHITE_8_RA7_SetOpenDrain()       do { ODCONAbits.ODCA7 = 1; } while(0)
#define WHITE_8_RA7_SetAnalogMode()      do { ANSELAbits.ANSELA7 = 1; } while(0)
#define WHITE_8_RA7_SetDigitalMode()     do { ANSELAbits.ANSELA7 = 0; } while(0)

// get/set RB0 procedures
#define RB0_SetHigh()            do { LATBbits.LATB0 = 1; } while(0)
#define RB0_SetLow()             do { LATBbits.LATB0 = 0; } while(0)
#define RB0_Toggle()             do { LATBbits.LATB0 = ~LATBbits.LATB0; } while(0)
#define POWER_KEY_RB0_GetValue()              PORTBbits.RB0
#define RB0_SetDigitalInput()    do { TRISBbits.TRISB0 = 1; } while(0)
#define RB0_SetDigitalOutput()   do { TRISBbits.TRISB0 = 0; } while(0)
#define RB0_SetPullup()             do { WPUBbits.WPUB0 = 1; } while(0)
#define RB0_ResetPullup()           do { WPUBbits.WPUB0 = 0; } while(0)
#define RB0_SetAnalogMode()         do { ANSELBbits.ANSELB0 = 1; } while(0)
#define RB0_SetDigitalMode()        do { ANSELBbits.ANSELB0 = 0; } while(0)

// get/set KEY_LAMP_1_RB1 aliases
#define KEY_LAMP_1_RB1_TRIS                 TRISBbits.TRISB1
#define KEY_LAMP_1_RB1_LAT                  LATBbits.LATB1
#define KEY_LAMP_1_RB1_PORT                 PORTBbits.RB1
#define KEY_LAMP_1_RB1_WPU                  WPUBbits.WPUB1
#define KEY_LAMP_1_RB1_OD                   ODCONBbits.ODCB1
#define KEY_LAMP_1_RB1_ANS                  ANSELBbits.ANSELB1
#define KEY_LAMP_1_RB1_SetHigh()            do { LATBbits.LATB1 = 1; } while(0)
#define KEY_LAMP_1_RB1_SetLow()             do { LATBbits.LATB1 = 0; } while(0)
#define KEY_LAMP_1_RB1_Toggle()             do { LATBbits.LATB1 = ~LATBbits.LATB1; } while(0)
#define KEY_LAMP_1_RB1_GetValue()           PORTBbits.RB1
#define KEY_LAMP_1_RB1_SetDigitalInput()    do { TRISBbits.TRISB1 = 1; } while(0)
#define KEY_LAMP_1_RB1_SetDigitalOutput()   do { TRISBbits.TRISB1 = 0; } while(0)
#define KEY_LAMP_1_RB1_SetPullup()          do { WPUBbits.WPUB1 = 1; } while(0)
#define KEY_LAMP_1_RB1_ResetPullup()        do { WPUBbits.WPUB1 = 0; } while(0)
#define KEY_LAMP_1_RB1_SetPushPull()        do { ODCONBbits.ODCB1 = 0; } while(0)
#define KEY_LAMP_1_RB1_SetOpenDrain()       do { ODCONBbits.ODCB1 = 1; } while(0)
#define KEY_LAMP_1_RB1_SetAnalogMode()      do { ANSELBbits.ANSELB1 = 1; } while(0)
#define KEY_LAMP_1_RB1_SetDigitalMode()     do { ANSELBbits.ANSELB1 = 0; } while(0)

// get/set KEY_LAMP_2_RB2 aliases
#define KEY_LAMP_2_RB2_TRIS                 TRISBbits.TRISB2
#define KEY_LAMP_2_RB2_LAT                  LATBbits.LATB2
#define KEY_LAMP_2_RB2_PORT                 PORTBbits.RB2
#define KEY_LAMP_2_RB2_WPU                  WPUBbits.WPUB2
#define KEY_LAMP_2_RB2_OD                   ODCONBbits.ODCB2
#define KEY_LAMP_2_RB2_ANS                  ANSELBbits.ANSELB2
#define KEY_LAMP_2_RB2_SetHigh()            do { LATBbits.LATB2 = 1; } while(0)
#define KEY_LAMP_2_RB2_SetLow()             do { LATBbits.LATB2 = 0; } while(0)
#define KEY_LAMP_2_RB2_Toggle()             do { LATBbits.LATB2 = ~LATBbits.LATB2; } while(0)
#define KEY_LAMP_2_RB2_GetValue()           PORTBbits.RB2
#define KEY_LAMP_2_RB2_SetDigitalInput()    do { TRISBbits.TRISB2 = 1; } while(0)
#define KEY_LAMP_2_RB2_SetDigitalOutput()   do { TRISBbits.TRISB2 = 0; } while(0)
#define KEY_LAMP_2_RB2_SetPullup()          do { WPUBbits.WPUB2 = 1; } while(0)
#define KEY_LAMP_2_RB2_ResetPullup()        do { WPUBbits.WPUB2 = 0; } while(0)
#define KEY_LAMP_2_RB2_SetPushPull()        do { ODCONBbits.ODCB2 = 0; } while(0)
#define KEY_LAMP_2_RB2_SetOpenDrain()       do { ODCONBbits.ODCB2 = 1; } while(0)
#define KEY_LAMP_2_RB2_SetAnalogMode()      do { ANSELBbits.ANSELB2 = 1; } while(0)
#define KEY_LAMP_2_RB2_SetDigitalMode()     do { ANSELBbits.ANSELB2 = 0; } while(0)

// get/set KEY_ADD_RB3 aliases
#define KEY_ADD_RB3_TRIS                 TRISBbits.TRISB3
#define KEY_ADD_RB3_LAT                  LATBbits.LATB3
#define KEY_ADD_RB3_PORT                 PORTBbits.RB3
#define KEY_ADD_RB3_WPU                  WPUBbits.WPUB3
#define KEY_ADD_RB3_OD                   ODCONBbits.ODCB3
#define KEY_ADD_RB3_ANS                  ANSELBbits.ANSELB3
#define KEY_ADD_RB3_SetHigh()            do { LATBbits.LATB3 = 1; } while(0)
#define KEY_ADD_RB3_SetLow()             do { LATBbits.LATB3 = 0; } while(0)
#define KEY_ADD_RB3_Toggle()             do { LATBbits.LATB3 = ~LATBbits.LATB3; } while(0)
#define KEY_ADD_RB3_GetValue()           PORTBbits.RB3
#define KEY_ADD_RB3_SetDigitalInput()    do { TRISBbits.TRISB3 = 1; } while(0)
#define KEY_ADD_RB3_SetDigitalOutput()   do { TRISBbits.TRISB3 = 0; } while(0)
#define KEY_ADD_RB3_SetPullup()          do { WPUBbits.WPUB3 = 1; } while(0)
#define KEY_ADD_RB3_ResetPullup()        do { WPUBbits.WPUB3 = 0; } while(0)
#define KEY_ADD_RB3_SetPushPull()        do { ODCONBbits.ODCB3 = 0; } while(0)
#define KEY_ADD_RB3_SetOpenDrain()       do { ODCONBbits.ODCB3 = 1; } while(0)
#define KEY_ADD_RB3_SetAnalogMode()      do { ANSELBbits.ANSELB3 = 1; } while(0)
#define KEY_ADD_RB3_SetDigitalMode()     do { ANSELBbits.ANSELB3 = 0; } while(0)

// get/set KEY_SUB_RB4 aliases
#define KEY_SUB_RB4_TRIS                 TRISBbits.TRISB4
#define KEY_SUB_RB4_LAT                  LATBbits.LATB4
#define KEY_SUB_RB4_PORT                 PORTBbits.RB4
#define KEY_SUB_RB4_WPU                  WPUBbits.WPUB4
#define KEY_SUB_RB4_OD                   ODCONBbits.ODCB4
#define KEY_SUB_RB4_ANS                  ANSELBbits.ANSELB4
#define KEY_SUB_RB4_SetHigh()            do { LATBbits.LATB4 = 1; } while(0)
#define KEY_SUB_RB4_SetLow()             do { LATBbits.LATB4 = 0; } while(0)
#define KEY_SUB_RB4_Toggle()             do { LATBbits.LATB4 = ~LATBbits.LATB4; } while(0)
#define KEY_SUB_RB4_GetValue()           PORTBbits.RB4
#define KEY_SUB_RB4_SetDigitalInput()    do { TRISBbits.TRISB4 = 1; } while(0)
#define KEY_SUB_RB4_SetDigitalOutput()   do { TRISBbits.TRISB4 = 0; } while(0)
#define KEY_SUB_RB4_SetPullup()          do { WPUBbits.WPUB4 = 1; } while(0)
#define KEY_SUB_RB4_ResetPullup()        do { WPUBbits.WPUB4 = 0; } while(0)
#define KEY_SUB_RB4_SetPushPull()        do { ODCONBbits.ODCB4 = 0; } while(0)
#define KEY_SUB_RB4_SetOpenDrain()       do { ODCONBbits.ODCB4 = 1; } while(0)
#define KEY_SUB_RB4_SetAnalogMode()      do { ANSELBbits.ANSELB4 = 1; } while(0)
#define KEY_SUB_RB4_SetDigitalMode()     do { ANSELBbits.ANSELB4 = 0; } while(0)

// get/set KEY_LASER_RB5 aliases
#define KEY_LASER_RB5_TRIS                 TRISBbits.TRISB5
#define KEY_LASER_RB5_LAT                  LATBbits.LATB5
#define KEY_LASER_RB5_PORT                 PORTBbits.RB5
#define KEY_LASER_RB5_WPU                  WPUBbits.WPUB5
#define KEY_LASER_RB5_OD                   ODCONBbits.ODCB5
#define KEY_LASER_RB5_ANS                  ANSELBbits.ANSELB5
#define KEY_LASER_RB5_SetHigh()            do { LATBbits.LATB5 = 1; } while(0)
#define KEY_LASER_RB5_SetLow()             do { LATBbits.LATB5 = 0; } while(0)
#define KEY_LASER_RB5_Toggle()             do { LATBbits.LATB5 = ~LATBbits.LATB5; } while(0)
#define KEY_LASER_RB5_GetValue()           PORTBbits.RB5
#define KEY_LASER_RB5_SetDigitalInput()    do { TRISBbits.TRISB5 = 1; } while(0)
#define KEY_LASER_RB5_SetDigitalOutput()   do { TRISBbits.TRISB5 = 0; } while(0)
#define KEY_LASER_RB5_SetPullup()          do { WPUBbits.WPUB5 = 1; } while(0)
#define KEY_LASER_RB5_ResetPullup()        do { WPUBbits.WPUB5 = 0; } while(0)
#define KEY_LASER_RB5_SetPushPull()        do { ODCONBbits.ODCB5 = 0; } while(0)
#define KEY_LASER_RB5_SetOpenDrain()       do { ODCONBbits.ODCB5 = 1; } while(0)
#define KEY_LASER_RB5_SetAnalogMode()      do { ANSELBbits.ANSELB5 = 1; } while(0)
#define KEY_LASER_RB5_SetDigitalMode()     do { ANSELBbits.ANSELB5 = 0; } while(0)

// get/set IO_POWER_RB7 aliases
#define IO_POWER_RB7_TRIS                 TRISBbits.TRISB7
#define IO_POWER_RB7_LAT                  LATBbits.LATB7
#define IO_POWER_RB7_PORT                 PORTBbits.RB7
#define IO_POWER_RB7_WPU                  WPUBbits.WPUB7
#define IO_POWER_RB7_OD                   ODCONBbits.ODCB7
#define IO_POWER_RB7_ANS                  ANSELBbits.ANSELB7
#define IO_POWER_RB7_SetHigh()            do { LATBbits.LATB7 = 1; } while(0)
#define IO_POWER_RB7_SetLow()             do { LATBbits.LATB7 = 0; } while(0)
#define IO_POWER_RB7_Toggle()             do { LATBbits.LATB7 = ~LATBbits.LATB7; } while(0)
#define IO_POWER_RB7_GetValue()           PORTBbits.RB7
#define IO_POWER_RB7_SetDigitalInput()    do { TRISBbits.TRISB7 = 1; } while(0)
#define IO_POWER_RB7_SetDigitalOutput()   do { TRISBbits.TRISB7 = 0; } while(0)
#define IO_POWER_RB7_SetPullup()          do { WPUBbits.WPUB7 = 1; } while(0)
#define IO_POWER_RB7_ResetPullup()        do { WPUBbits.WPUB7 = 0; } while(0)
#define IO_POWER_RB7_SetPushPull()        do { ODCONBbits.ODCB7 = 0; } while(0)
#define IO_POWER_RB7_SetOpenDrain()       do { ODCONBbits.ODCB7 = 1; } while(0)
#define IO_POWER_RB7_SetAnalogMode()      do { ANSELBbits.ANSELB7 = 1; } while(0)
#define IO_POWER_RB7_SetDigitalMode()     do { ANSELBbits.ANSELB7 = 0; } while(0)

// get/set RC0 procedures
#define RC0_SetHigh()            do { LATCbits.LATC0 = 1; } while(0)
#define RC0_SetLow()             do { LATCbits.LATC0 = 0; } while(0)
#define RC0_Toggle()             do { LATCbits.LATC0 = ~LATCbits.LATC0; } while(0)
#define RC0_GetValue()              PORTCbits.RC0
#define RC0_SetDigitalInput()    do { TRISCbits.TRISC0 = 1; } while(0)
#define RC0_SetDigitalOutput()   do { TRISCbits.TRISC0 = 0; } while(0)
#define RC0_SetPullup()             do { WPUCbits.WPUC0 = 1; } while(0)
#define RC0_ResetPullup()           do { WPUCbits.WPUC0 = 0; } while(0)
#define RC0_SetAnalogMode()         do { ANSELCbits.ANSELC0 = 1; } while(0)
#define RC0_SetDigitalMode()        do { ANSELCbits.ANSELC0 = 0; } while(0)

// get/set RC1 procedures
#define HALF_PHASE_RC1_SetLow()      do { LATCbits.LATC1 = 0; } while(0)
#define HALF_PHASE_RC1_SetHigh()     do { LATCbits.LATC1 = 1; } while(0)

