haliwt/UnipolarMotor_pic18f24k40PRO/mcc_generated_files/pin_manager.h
#define RC1_Toggle()             do { LATCbits.LATC1 = ~LATCbits.LATC1; } while(0)
#define RC1_GetValue()              PORTCbits.RC1
#define RC1_SetDigitalInput()    do { TRISCbits.TRISC1 = 1; } while(0)
#define RC1_SetDigitalOutput()   do { TRISCbits.TRISC1 = 0; } while(0)
#define RC1_SetPullup()             do { WPUCbits.WPUC1 = 1; } while(0)
#define RC1_ResetPullup()           do { WPUCbits.WPUC1 = 0; } while(0)
#define RC1_SetAnalogMode()         do { ANSELCbits.ANSELC1 = 1; } while(0)
#define RC1_SetDigitalMode()        do { ANSELCbits.ANSELC1 = 0; } while(0)

// get/set BLE_MODE_RC2 aliases
#define ONE_PHASE_RC2_SetLow()             do { LATCbits.LATC2 = 0; } while(0)
#define ONE_PHASE_RC2_SetHigh()            do { LATCbits.LATC2 = 1; } while(0)
#define BLE_MODE_RC2_TRIS                 TRISCbits.TRISC2
#define BLE_MODE_RC2_LAT                  LATCbits.LATC2
#define BLE_MODE_RC2_PORT                 PORTCbits.RC2
#define BLE_MODE_RC2_WPU                  WPUCbits.WPUC2
#define BLE_MODE_RC2_OD                   ODCONCbits.ODCC2
#define BLE_MODE_RC2_ANS                  ANSELCbits.ANSELC2
#define BLE_MODE_RC2_SetHigh()            do { LATCbits.LATC2 = 1; } while(0)
#define BLE_MODE_RC2_SetLow()             do { LATCbits.LATC2 = 0; } while(0)
#define BLE_MODE_RC2_Toggle()             do { LATCbits.LATC2 = ~LATCbits.LATC2; } while(0)
#define BLE_MODE_RC2_GetValue()           PORTCbits.RC2
#define BLE_MODE_RC2_SetDigitalInput()    do { TRISCbits.TRISC2 = 1; } while(0)
#define BLE_MODE_RC2_SetDigitalOutput()   do { TRISCbits.TRISC2 = 0; } while(0)
#define BLE_MODE_RC2_SetPullup()          do { WPUCbits.WPUC2 = 1; } while(0)
#define BLE_MODE_RC2_ResetPullup()        do { WPUCbits.WPUC2 = 0; } while(0)
#define BLE_MODE_RC2_SetPushPull()        do { ODCONCbits.ODCC2 = 0; } while(0)
#define BLE_MODE_RC2_SetOpenDrain()       do { ODCONCbits.ODCC2 = 1; } while(0)
#define BLE_MODE_RC2_SetAnalogMode()      do { ANSELCbits.ANSELC2 = 1; } while(0)
#define BLE_MODE_RC2_SetDigitalMode()     do { ANSELCbits.ANSELC2 = 0; } while(0)

// get/set FAN_RC3 aliases
#define FAN_RC3_TRIS                 TRISCbits.TRISC3
#define FAN_RC3_LAT                  LATCbits.LATC3
#define FAN_RC3_PORT                 PORTCbits.RC3
#define FAN_RC3_WPU                  WPUCbits.WPUC3
#define FAN_RC3_OD                   ODCONCbits.ODCC3
#define FAN_RC3_ANS                  ANSELCbits.ANSELC3
#define FAN_RC3_SetHigh()            do { LATCbits.LATC3 = 1; } while(0)
#define FAN_RC3_SetLow()             do { LATCbits.LATC3 = 0; } while(0)
#define FAN_RC3_Toggle()             do { LATCbits.LATC3 = ~LATCbits.LATC3; } while(0)
#define FAN_RC3_GetValue()           PORTCbits.RC3
#define FAN_RC3_SetDigitalInput()    do { TRISCbits.TRISC3 = 1; } while(0)
#define FAN_RC3_SetDigitalOutput()   do { TRISCbits.TRISC3 = 0; } while(0)
#define FAN_RC3_SetPullup()          do { WPUCbits.WPUC3 = 1; } while(0)
#define FAN_RC3_ResetPullup()        do { WPUCbits.WPUC3 = 0; } while(0)
#define FAN_RC3_SetPushPull()        do { ODCONCbits.ODCC3 = 0; } while(0)
#define FAN_RC3_SetOpenDrain()       do { ODCONCbits.ODCC3 = 1; } while(0)
#define FAN_RC3_SetAnalogMode()      do { ANSELCbits.ANSELC3 = 1; } while(0)
#define FAN_RC3_SetDigitalMode()     do { ANSELCbits.ANSELC3 = 0; } while(0)

// get/set BLE_RST_RC4 aliases
#define BLE_RST_RC4_TRIS                 TRISCbits.TRISC4
#define BLE_RST_RC4_LAT                  LATCbits.LATC4
#define BLE_RST_RC4_PORT                 PORTCbits.RC4
#define BLE_RST_RC4_WPU                  WPUCbits.WPUC4
#define BLE_RST_RC4_OD                   ODCONCbits.ODCC4
#define BLE_RST_RC4_ANS                  ANSELCbits.ANSELC4
#define BLE_RST_RC4_SetHigh()            do { LATCbits.LATC4 = 1; } while(0)
#define BLE_RST_RC4_SetLow()             do { LATCbits.LATC4 = 0; } while(0)
#define BLE_RST_RC4_Toggle()             do { LATCbits.LATC4 = ~LATCbits.LATC4; } while(0)
#define BLE_RST_RC4_GetValue()           PORTCbits.RC4
#define BLE_RST_RC4_SetDigitalInput()    do { TRISCbits.TRISC4 = 1; } while(0)
#define BLE_RST_RC4_SetDigitalOutput()   do { TRISCbits.TRISC4 = 0; } while(0)
#define BLE_RST_RC4_SetPullup()          do { WPUCbits.WPUC4 = 1; } while(0)
#define BLE_RST_RC4_ResetPullup()        do { WPUCbits.WPUC4 = 0; } while(0)
#define BLE_RST_RC4_SetPushPull()        do { ODCONCbits.ODCC4 = 0; } while(0)
#define BLE_RST_RC4_SetOpenDrain()       do { ODCONCbits.ODCC4 = 1; } while(0)
#define BLE_RST_RC4_SetAnalogMode()      do { ANSELCbits.ANSELC4 = 1; } while(0)
#define BLE_RST_RC4_SetDigitalMode()     do { ANSELCbits.ANSELC4 = 0; } while(0)

// get/set BLE_LINK_RC5 aliases
#define BLE_LINK_RC5_TRIS                 TRISCbits.TRISC5
#define BLE_LINK_RC5_LAT                  LATCbits.LATC5
#define BLE_LINK_RC5_PORT                 PORTCbits.RC5
#define BLE_LINK_RC5_WPU                  WPUCbits.WPUC5
#define BLE_LINK_RC5_OD                   ODCONCbits.ODCC5
#define BLE_LINK_RC5_ANS                  ANSELCbits.ANSELC5
#define BLE_LINK_RC5_SetHigh()            do { LATCbits.LATC5 = 1; } while(0)
#define BLE_LINK_RC5_SetLow()             do { LATCbits.LATC5 = 0; } while(0)
#define BLE_LINK_RC5_Toggle()             do { LATCbits.LATC5 = ~LATCbits.LATC5; } while(0)
#define BLE_LINK_RC5_GetValue()           PORTCbits.RC5
#define BLE_LINK_RC5_SetDigitalInput()    do { TRISCbits.TRISC5 = 1; } while(0)
#define BLE_LINK_RC5_SetDigitalOutput()   do { TRISCbits.TRISC5 = 0; } while(0)
#define BLE_LINK_RC5_SetPullup()          do { WPUCbits.WPUC5 = 1; } while(0)
#define BLE_LINK_RC5_ResetPullup()        do { WPUCbits.WPUC5 = 0; } while(0)
#define BLE_LINK_RC5_SetPushPull()        do { ODCONCbits.ODCC5 = 0; } while(0)
#define BLE_LINK_RC5_SetOpenDrain()       do { ODCONCbits.ODCC5 = 1; } while(0)
#define BLE_LINK_RC5_SetAnalogMode()      do { ANSELCbits.ANSELC5 = 1; } while(0)
#define BLE_LINK_RC5_SetDigitalMode()     do { ANSELCbits.ANSELC5 = 0; } while(0)

// get/set RC6 procedures
#define RC6_SetHigh()            do { LATCbits.LATC6 = 1; } while(0)
#define RC6_SetLow()             do { LATCbits.LATC6 = 0; } while(0)
#define RC6_Toggle()             do { LATCbits.LATC6 = ~LATCbits.LATC6; } while(0)
#define RC6_GetValue()              PORTCbits.RC6
#define RC6_SetDigitalInput()    do { TRISCbits.TRISC6 = 1; } while(0)
#define RC6_SetDigitalOutput()   do { TRISCbits.TRISC6 = 0; } while(0)
#define RC6_SetPullup()             do { WPUCbits.WPUC6 = 1; } while(0)
#define RC6_ResetPullup()           do { WPUCbits.WPUC6 = 0; } while(0)
#define RC6_SetAnalogMode()         do { ANSELCbits.ANSELC6 = 1; } while(0)
#define RC6_SetDigitalMode()        do { ANSELCbits.ANSELC6 = 0; } while(0)

// get/set RC7 procedures
#define RC7_SetHigh()            do { LATCbits.LATC7 = 1; } while(0)
#define RC7_SetLow()             do { LATCbits.LATC7 = 0; } while(0)
#define RC7_Toggle()             do { LATCbits.LATC7 = ~LATCbits.LATC7; } while(0)
#define RC7_GetValue()              PORTCbits.RC7
#define RC7_SetDigitalInput()    do { TRISCbits.TRISC7 = 1; } while(0)
#define RC7_SetDigitalOutput()   do { TRISCbits.TRISC7 = 0; } while(0)
#define RC7_SetPullup()             do { WPUCbits.WPUC7 = 1; } while(0)
#define RC7_ResetPullup()           do { WPUCbits.WPUC7 = 0; } while(0)
#define RC7_SetAnalogMode()         do { ANSELCbits.ANSELC7 = 1; } while(0)
#define RC7_SetDigitalMode()        do { ANSELCbits.ANSELC7 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);

/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handling routine
 * @Example
    PIN_MANAGER_IOC();
 */
void PIN_MANAGER_IOC(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/